case/elect_cooling3/constant/cpu/polyMesh/boundary

FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/cpu/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    wall-cpu
    {
        type            wall;
        inGroups        1(wall);
        nFaces          196;
        startFace       364;
    }
    cpu-solid
    {
        type            mappedWall;
        nFaces          252;
        startFace       560;
        sampleRegion    air;
        samplePatch cpu-fluid;
        sampleMode  nearestPatchFace;
        offsetMode  uniform;
        offset  (0 0 0);
    }
)

// ************************************************************************* //
