case/elect_cooling3/0/air/p_rgh
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	p_rgh;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000;
boundaryField
{
	wall
	{
		type	fixedFluxPressure;
	}
	
	cpu-fluid
	{
		type	fixedFluxPressure;
	}
	
	inlet
	{
		type	fixedFluxPressure;
	}
	outlet
	{
		type	fixedValue;
		value	uniform 100000;
	}
}
