case/elect_cooling3/0/air/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 300;
boundaryField
{
	wall
	{
		type	zeroGradient;
	}
	
	cpu-fluid
	{
		type	compressible::turbulentTemperatureRadCoupledMixed;
		value	uniform 300;
		qrNbr	none;
		qr	none;
		//neighbourFieldName	T;
		//alphaAni	Anialpha;
		kappaMethod	fluidThermo;
		//kappa	none;
		Tnbr	T;
		//thicknessLayers	();
		//kappaLayers	();
		useImplicit     true;
	}
	
	inlet
	{
		//type	totalTemperature;
		//T0	uniform 300;
		//gamma	1.396;
		//type	fixedValue;
		//value	uniform 300;
		type	inletOutlet;
		inletValue	uniform 300;
	}
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 300;
	}
}
