case/elect_cooling3/0/air/alphat
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	alphat;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -1 0 0 0 0];
internalField	uniform 0;
boundaryField
{
	wall
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0;
		Prt	0.85;
	}
	cpu-fluid
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0;
		Prt	0.85;
	}
	
	inlet
	{
		type	calculated;
		value	uniform 0;
	}
	outlet
	{
		type	calculated;
		value	uniform 0;
	}
}
