case/elect_cooling3/0/air/epsilon
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	epsilon;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -3 0 0 0 0];
internalField	uniform 1;
boundaryField
{
	wall
	{
		type	epsilonWallFunction;
		value	uniform 1;
	}
	
	cpu-fluid
	{
		type	epsilonWallFunction;
		value	uniform 1;
	}
	
	inlet
	{
		type	turbulentMixingLengthDissipationRateInlet;
		value	uniform 1;
		mixingLength	0.001;
	}
	outlet
	{
		type	zeroGradient;
	}
}
