case/elect_cooling3/0/air/nut
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	nut;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -1 0 0 0 0];
internalField	uniform 0.10000000149011612;
boundaryField
{
	wall
	{
		type	nutUWallFunction;
		value	uniform 0.10000000149011612;
	}
	
	cpu-fluid
	{
		type	nutUWallFunction;
		value	uniform 0.10000000149011612;
	}
	
	inlet
	{
		type	calculated;
		value	uniform 0.10000000149011612;
	}
	outlet
	{
		type	calculated;
		value	uniform 0.10000000149011612;
	}
}
