case/elect_cooling3/system/cpu/fvSchemes
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system/solid";
	object	fvSchemes;
}
ddtSchemes
{
	default	steadyState;
}
gradSchemes
{
	default	Gauss linear;
}
divSchemes
{
	div(((rho*nuEff)*dev2(T(grad(U)))))	Gauss linear;
	div(R)	Gauss linear;
	default	Gauss upwind;
	div(phi,U)	bounded Gauss upwind;
	div(phi,h)	bounded Gauss upwind;
	div(phi,k)	Gauss upwind;
	div(phi,epsilon)	Gauss upwind;
	div(phi,alphat)	Gauss upwind;
}
laplacianSchemes
{
	default	Gauss linear corrected;
}
interpolationSchemes
{
	default	linear;
}
snGradSchemes
{
	default	corrected;
}
