case/elect_cooling3/system/surfaceFeatureExtractDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	surfaceFeatureExtractDict;
}
cpu.stl
{
	extractionMethod	extractFromSurface;
	includedAngle	120;
	geometricTestOnly	false;
}
board.stl
{
	extractionMethod	extractFromSurface;
	includedAngle	120;
	geometricTestOnly	false;
}
